[NoCoverage] BlockStatement
src/auth/auth.controller.ts:41:48
   @Public()
   @Post('register')
   @HttpCode(HttpStatus.CREATED)
-  create(@Body() createUserDto: CreateUserDto) {
-    return this.authService.createUser(createUserDto);
-  }
+  create(@Body() createUserDto: CreateUserDto) {}
 
   @Public()

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:48:49
   @Public()
   @Post('verify-otp')
   @HttpCode(HttpStatus.OK)
-  verifyOtp(@Body() verifyOtpDto: VerifyOtpDto) {
-    return this.authService.verifyOtp(verifyOtpDto);
-  }
+  verifyOtp(@Body() verifyOtpDto: VerifyOtpDto) {}
   @Public()
   @Post('resend-verification-otp')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:54:61
   @Public()
   @Post('resend-verification-otp')
   @HttpCode(HttpStatus.OK)
-  resendVerificationOtp(@Body() resendOtpDto: ResendOtpDto) {
-    return this.authService.resendVerificationOtp(resendOtpDto.email);
-  }
+  resendVerificationOtp(@Body() resendOtpDto: ResendOtpDto) {}
 
   @Post('register-admin')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:62:53
   @HttpCode(HttpStatus.CREATED)
   @Roles(UserRole.ADMIN)
   @UseGuards(JwtAuthGuard, RolesGuard)
-  createAdmin(@Body() createUserDto: CreateUserDto) {
-    return this.authService.createAdminUser(createUserDto);
-  }
+  createAdmin(@Body() createUserDto: CreateUserDto) {}
   @Public()
   @Post('login')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:68:45
   @Public()
   @Post('login')
   @HttpCode(HttpStatus.OK)
-  login(@Body() loginUserDto: LoginUserDto) {
-    return this.authService.login(loginUserDto);
-  }
+  login(@Body() loginUserDto: LoginUserDto) {}
   @Public()
   @Post('refresh-token')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:74:60
   @Public()
   @Post('refresh-token')
   @HttpCode(HttpStatus.OK)
-  refreshToken(@Body('refreshToken') refreshToken: string) {
-    return this.authService.refreshToken(refreshToken);
-  }
+  refreshToken(@Body('refreshToken') refreshToken: string) {}
 
   @Get('current-user')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:81:50
   @Get('current-user')
   @HttpCode(HttpStatus.OK)
   @UseGuards(JwtAuthGuard)
-  retrieveCurrentUser(@CurrentUser() user: User) {
-    return user;
-  }
+  retrieveCurrentUser(@CurrentUser() user: User) {}
 
   @Public()

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:88:76
   @Public()
   @Post('forgot-password')
   @HttpCode(HttpStatus.OK)
-  forgotPassword(@Body() sendPasswordResetOtpDto: SendPasswordResetOtpDto) {
-    return this.authService.requestResetPasswordOtp(sendPasswordResetOtpDto);
-  }
+  forgotPassword(@Body() sendPasswordResetOtpDto: SendPasswordResetOtpDto) {}
 
   @Public()

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:97:5
   @HttpCode(HttpStatus.OK)
   requestResetPasswordOtp(
     @Body() sendPasswordResetOtpDto: SendPasswordResetOtpDto,
-  ) {
-    return this.authService.requestResetPasswordOtp(sendPasswordResetOtpDto);
-  }
+  ) {}
   @Public()
   @Post('resend-reset-password-otp')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:103:74
   @Public()
   @Post('resend-reset-password-otp')
   @HttpCode(HttpStatus.OK)
-  resendResetPasswordVerificationOtp(@Body() resendOtpDto: ResendOtpDto) {
-    return this.authService.resendResetPasswordVerificationOtp(resendOtpDto);
-  }
+  resendResetPasswordVerificationOtp(@Body() resendOtpDto: ResendOtpDto) {}
 
   @Public()

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:110:62
   @Public()
   @Post('verify-reset-password-otp')
   @HttpCode(HttpStatus.OK)
-  verifyResetPasswordOtp(@Body() verifyOtpDto: VerifyOtpDto) {
-    return this.authService.verifyResetPasswordOtp(verifyOtpDto);
-  }
+  verifyResetPasswordOtp(@Body() verifyOtpDto: VerifyOtpDto) {}
 
   @Public()

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:117:67
   @Public()
   @Post('reset-password')
   @HttpCode(HttpStatus.OK)
-  async resetPassword(@Body() resetPasswordDto: ResetPasswordDto) {
-    return this.authService.resetPassword(resetPasswordDto);
-  }
+  async resetPassword(@Body() resetPasswordDto: ResetPasswordDto) {}
 
   @Post('2fa/setup')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:124:50
   @Post('2fa/setup')
   @HttpCode(HttpStatus.OK)
   @UseGuards(JwtAuthGuard)
-  setup2fa(@GetCurrentUser('id') userId: string) {
-    return this.authService.setup2fa(userId);
-  }
+  setup2fa(@GetCurrentUser('id') userId: string) {}
 
   @Post('2fa/confirm')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:131:78
   @Post('2fa/confirm')
   @HttpCode(HttpStatus.OK)
   @UseGuards(JwtAuthGuard)
-  confirm2fa(@GetCurrentUser('id') userId: string, @Body() dto: Setup2faDto) {
-    return this.authService.confirm2fa(userId, dto);
-  }
+  confirm2fa(@GetCurrentUser('id') userId: string, @Body() dto: Setup2faDto) {}
 
   @Public()

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:138:47
   @Public()
   @Post('2fa/verify')
   @HttpCode(HttpStatus.OK)
-  verifyTotpLogin(@Body() dto: VerifyTotpDto) {
-    return this.authService.verifyTotpLogin(dto);
-  }
+  verifyTotpLogin(@Body() dto: VerifyTotpDto) {}
 
   @Public()

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:145:51
   @Public()
   @Post('2fa/backup-code')
   @HttpCode(HttpStatus.OK)
-  verifyBackupCode(@Body() dto: UseBackupCodeDto) {
-    return this.authService.verifyBackupCode(dto);
-  }
+  verifyBackupCode(@Body() dto: UseBackupCodeDto) {}
 
   @Post('2fa/disable')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:152:80
   @Post('2fa/disable')
   @HttpCode(HttpStatus.OK)
   @UseGuards(JwtAuthGuard)
-  disable2fa(@GetCurrentUser('id') userId: string, @Body() dto: Disable2faDto) {
-    return this.authService.disable2fa(userId, dto);
-  }
+  disable2fa(@GetCurrentUser('id') userId: string, @Body() dto: Disable2faDto) {}
 
   @Get('2fa/status')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:159:54
   @Get('2fa/status')
   @HttpCode(HttpStatus.OK)
   @UseGuards(JwtAuthGuard)
-  get2faStatus(@GetCurrentUser('id') userId: string) {
-    return this.authService.get2faStatus(userId);
-  }
+  get2faStatus(@GetCurrentUser('id') userId: string) {}
 }
 
