[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:64:9
     const validPassword = this.userHelper.isValidPassword(
       createUserDto.password,
     );
-    if (!validPassword) {
+    if (false) {
       throw new ConflictException(UserMessages.IS_VALID_PASSWORD);
     }

[NoCoverage] BlockStatement
src/auth/auth.service.ts:64:25
     const validPassword = this.userHelper.isValidPassword(
       createUserDto.password,
     );
-    if (!validPassword) {
-      throw new ConflictException(UserMessages.IS_VALID_PASSWORD);
-    }
+    if (!validPassword) {}
     const hashedPassword = await this.userHelper.hashPassword(
       createUserDto.password,

[NoCoverage] BooleanLiteral
src/auth/auth.service.ts:80:19
       role: UserRole.USER,
       verificationCode: verificationCode,
       verificationCodeExpiresAt: expiration,
-      isVerified: false,
+      isVerified: true,
     });
     await this.userRepository.save(newUser);

[NoCoverage] StringLiteral
src/auth/auth.service.ts:87:7
     await this.emailService.sendVerificationEmail(
       newUser.email,
       verificationCode,
-      `${newUser.firstname} ${newUser.lastname}`,
+      ``,
     );
 

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:99:60
   }
 
   async createAdminUser(createUserDto: CreateUserDto) {
-    const existingUser = await this.userRepository.findOne({
-      where: { email: createUserDto.email },
-    });
+    const existingUser = await this.userRepository.findOne({});
 
     if (existingUser) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:103:23
       where: { email: createUserDto.email },
     });
 
-    if (existingUser) {
-      throw new ConflictException(UserMessages.EMAIL_ALREADY_EXIST);
-    }
+    if (existingUser) {}
 
     const validPassword = this.userHelper.isValidPassword(

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:127:12
 
     const accessToken = this.jwtHelper.generateAccessToken(newUser);
 
-    return {
-      user: this.userHelper.formatUserResponse(newUser),
-      accessToken,
-    };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/auth/auth.service.ts:136:17
   async verifyOtp(verifyOtpDto: VerifyOtpDto) {
     const { email, otp } = verifyOtpDto;
 
-    if (!email) {
-      throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
-    }
+    if (!email) {}
 
     if (!otp) {

[NoCoverage] BooleanLiteral
src/auth/auth.service.ts:140:9
       throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
     }
 
-    if (!otp) {
+    if (otp) {
       throw new BadRequestException(UserMessages.OTP_REQUIRED);
     }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:140:9
       throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
     }
 
-    if (!otp) {
+    if (true) {
       throw new BadRequestException(UserMessages.OTP_REQUIRED);
     }

[NoCoverage] BlockStatement
src/auth/auth.service.ts:146:16
 
     const user = await this.userRepository.findOne({ where: { email } });
 
-    if (!user) {
-      throw new UnauthorizedException(UserMessages.USER_NOT_FOUND);
-    }
+    if (!user) {}
 
     if (user.verificationCode !== otp) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:150:40
       throw new UnauthorizedException(UserMessages.USER_NOT_FOUND);
     }
 
-    if (user.verificationCode !== otp) {
-      throw new UnauthorizedException(UserMessages.INVALID_OTP);
-    }
+    if (user.verificationCode !== otp) {}
 
     if (

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:150:9
       throw new UnauthorizedException(UserMessages.USER_NOT_FOUND);
     }
 
-    if (user.verificationCode !== otp) {
+    if (false) {
       throw new UnauthorizedException(UserMessages.INVALID_OTP);
     }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:155:7
     }
 
     if (
-      !user.verificationCodeExpiresAt ||
-      user.verificationCodeExpiresAt < new Date()
+      true
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:155:7
     }
 
     if (
-      !user.verificationCodeExpiresAt ||
-      user.verificationCodeExpiresAt < new Date()
+      false
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] EqualityOperator
src/auth/auth.service.ts:156:7
 
     if (
       !user.verificationCodeExpiresAt ||
-      user.verificationCodeExpiresAt < new Date()
+      user.verificationCodeExpiresAt <= new Date()
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:156:7
 
     if (
       !user.verificationCodeExpiresAt ||
-      user.verificationCodeExpiresAt < new Date()
+      false
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] BlockStatement
src/auth/auth.service.ts:157:7
     if (
       !user.verificationCodeExpiresAt ||
       user.verificationCodeExpiresAt < new Date()
-    ) {
-      throw new UnauthorizedException(UserMessages.OTP_EXPIRED);
-    }
+    ) {}
 
     user.isVerified = true;

[NoCoverage] BooleanLiteral
src/auth/auth.service.ts:161:23
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);
     }
 
-    user.isVerified = true;
+    user.isVerified = false;
     user.verificationCode = '';
     user.verificationCodeExpiresAt = undefined;

[NoCoverage] BlockStatement
src/auth/auth.service.ts:177:9
   }
 
   async resendVerificationOtp(email: string) {
-    try {
-      if (!email) {
-        throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
-      }
-
-      const user = await this.userRepository.findOne({ where: { email } });
-      if (!user) {
-        throw new NotFoundException(UserMessages.USER_NOT_FOUND);
-      }
-
-      const verificationCode = this.userHelper.generateVerificationCode();
-
-      user.verificationCode = verificationCode;
-      user.verificationCodeExpiresAt = moment().add(10, 'minutes').toDate();
-      await this.userRepository.save(user);
-
-      await this.emailService.sendVerificationEmail(
-        user.email,
-        verificationCode,
-        `${user.firstname} ${user.lastname}`,
-      );
-
-      return { message: UserMessages.OTP_SENT };
-    } catch (error) {
+    try {} catch (error) {
       throw new InternalServerErrorException(
         error || 'Error resending verification code',

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:178:11
 
   async resendVerificationOtp(email: string) {
     try {
-      if (!email) {
+      if (false) {
         throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
       }

[NoCoverage] BlockStatement
src/auth/auth.service.ts:178:19
 
   async resendVerificationOtp(email: string) {
     try {
-      if (!email) {
-        throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
-      }
+      if (!email) {}
 
       const user = await this.userRepository.findOne({ where: { email } });

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:183:11
       }
 
       const user = await this.userRepository.findOne({ where: { email } });
-      if (!user) {
+      if (false) {
         throw new NotFoundException(UserMessages.USER_NOT_FOUND);
       }

[NoCoverage] BlockStatement
src/auth/auth.service.ts:183:18
       }
 
       const user = await this.userRepository.findOne({ where: { email } });
-      if (!user) {
-        throw new NotFoundException(UserMessages.USER_NOT_FOUND);
-      }
+      if (!user) {}
 
       const verificationCode = this.userHelper.generateVerificationCode();

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:199:14
         `${user.firstname} ${user.lastname}`,
       );
 
-      return { message: UserMessages.OTP_SENT };
+      return {};
     } catch (error) {
       throw new InternalServerErrorException(

[NoCoverage] BlockStatement
src/auth/auth.service.ts:200:21
       );
 
       return { message: UserMessages.OTP_SENT };
-    } catch (error) {
-      throw new InternalServerErrorException(
-        error || 'Error resending verification code',
-      );
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:202:9
       return { message: UserMessages.OTP_SENT };
     } catch (error) {
       throw new InternalServerErrorException(
-        error || 'Error resending verification code',
+        false,
       );
     }

[NoCoverage] LogicalOperator
src/auth/auth.service.ts:202:9
       return { message: UserMessages.OTP_SENT };
     } catch (error) {
       throw new InternalServerErrorException(
-        error || 'Error resending verification code',
+        error && 'Error resending verification code',
       );
     }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:212:7
       where: { email: loginUserDto.email },
     });
     if (
-      !user ||
-      !(await this.userHelper.verifyPassword(
-        loginUserDto.password,
-        user.password,
-      ))
+      false
     ) {
       throw new UnauthorizedException(UserMessages.INVALID_CREDENTIALS);

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:212:7
       where: { email: loginUserDto.email },
     });
     if (
-      !user ||
-      !(await this.userHelper.verifyPassword(
-        loginUserDto.password,
-        user.password,
-      ))
+      true
     ) {
       throw new UnauthorizedException(UserMessages.INVALID_CREDENTIALS);

[NoCoverage] BooleanLiteral
src/auth/auth.service.ts:213:7
     });
     if (
       !user ||
-      !(await this.userHelper.verifyPassword(
-        loginUserDto.password,
-        user.password,
-      ))
+      await this.userHelper.verifyPassword(loginUserDto.password, user.password)
     ) {
       throw new UnauthorizedException(UserMessages.INVALID_CREDENTIALS);

[NoCoverage] BlockStatement
src/auth/auth.service.ts:217:7
         loginUserDto.password,
         user.password,
       ))
-    ) {
-      throw new UnauthorizedException(UserMessages.INVALID_CREDENTIALS);
-    }
+    ) {}
 
     if (!user.isVerified) {

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:221:9
       throw new UnauthorizedException(UserMessages.INVALID_CREDENTIALS);
     }
 
-    if (!user.isVerified) {
+    if (false) {
       await this.resendVerificationOtp(loginUserDto.email);
       return {

[NoCoverage] BooleanLiteral
src/auth/auth.service.ts:221:9
       throw new UnauthorizedException(UserMessages.INVALID_CREDENTIALS);
     }
 
-    if (!user.isVerified) {
+    if (user.isVerified) {
       await this.resendVerificationOtp(loginUserDto.email);
       return {

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:223:14
 
     if (!user.isVerified) {
       await this.resendVerificationOtp(loginUserDto.email);
-      return {
-        message: UserMessages.EMAIL_NOT_VERIFIED,
-        user: this.userHelper.formatUserResponse(user),
-      };
+      return {};
     }
 

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:229:9
       };
     }
 
-    if (user.twoFactorEnabled) {
+    if (true) {
       const tempToken = this.jwtHelper.generateTempToken(user.id);
       return { requiresTwoFactor: true, tempToken };

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:229:9
       };
     }
 
-    if (user.twoFactorEnabled) {
+    if (false) {
       const tempToken = this.jwtHelper.generateTempToken(user.id);
       return { requiresTwoFactor: true, tempToken };

[NoCoverage] BooleanLiteral
src/auth/auth.service.ts:231:35
 
     if (user.twoFactorEnabled) {
       const tempToken = this.jwtHelper.generateTempToken(user.id);
-      return { requiresTwoFactor: true, tempToken };
+      return { requiresTwoFactor: false, tempToken };
     }
 

[NoCoverage] BlockStatement
src/auth/auth.service.ts:240:44
       accessToken,
     };
   }
-  async refreshToken(refreshToken: string) {
-    const userId = this.jwtHelper.validateRefreshToken(refreshToken);
-    const user = await this.userRepository.findOne({
-      where: { id: userId },
-    });
-    if (!user) {
-      throw new UnauthorizedException(UserMessages.INVALID_REFRESH_TOKEN);
-    }
-    const accessToken = this.jwtHelper.generateAccessToken(user);
-    return { accessToken };
-  }
+  async refreshToken(refreshToken: string) {}
   async retrieveUserById(userId: string) {
     const user = await this.userRepository.findOne({

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:243:14
   async refreshToken(refreshToken: string) {
     const userId = this.jwtHelper.validateRefreshToken(refreshToken);
     const user = await this.userRepository.findOne({
-      where: { id: userId },
+      where: {},
     });
     if (!user) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:245:16
     const user = await this.userRepository.findOne({
       where: { id: userId },
     });
-    if (!user) {
-      throw new UnauthorizedException(UserMessages.INVALID_REFRESH_TOKEN);
-    }
+    if (!user) {}
     const accessToken = this.jwtHelper.generateAccessToken(user);
     return { accessToken };

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:249:12
       throw new UnauthorizedException(UserMessages.INVALID_REFRESH_TOKEN);
     }
     const accessToken = this.jwtHelper.generateAccessToken(user);
-    return { accessToken };
+    return {};
   }
   async retrieveUserById(userId: string) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:251:42
     const accessToken = this.jwtHelper.generateAccessToken(user);
     return { accessToken };
   }
-  async retrieveUserById(userId: string) {
-    const user = await this.userRepository.findOne({
-      where: { id: userId },
-    });
-    if (!user) {
-      throw new UnauthorizedException('User not found.');
-    }
-    const result = this.userHelper.formatUserResponse(user);
-    return result;
-  }
+  async retrieveUserById(userId: string) {}
 
   async requestResetPasswordOtp(

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:252:52
     return { accessToken };
   }
   async retrieveUserById(userId: string) {
-    const user = await this.userRepository.findOne({
-      where: { id: userId },
-    });
+    const user = await this.userRepository.findOne({});
     if (!user) {
       throw new UnauthorizedException('User not found.');

[NoCoverage] BlockStatement
src/auth/auth.service.ts:255:16
     const user = await this.userRepository.findOne({
       where: { id: userId },
     });
-    if (!user) {
-      throw new UnauthorizedException('User not found.');
-    }
+    if (!user) {}
     const result = this.userHelper.formatUserResponse(user);
     return result;

[NoCoverage] BlockStatement
src/auth/auth.service.ts:265:41
   async requestResetPasswordOtp(
     sendPasswordResetOtpDto: SendPasswordResetOtpDto,
   ) {
-    if (!sendPasswordResetOtpDto.email) {
-      throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
-    }
+    if (!sendPasswordResetOtpDto.email) {}
 
     const user = await this.userRepository.findOne({

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:265:9
   async requestResetPasswordOtp(
     sendPasswordResetOtpDto: SendPasswordResetOtpDto,
   ) {
-    if (!sendPasswordResetOtpDto.email) {
+    if (false) {
       throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
     }

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:269:52
       throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
     }
 
-    const user = await this.userRepository.findOne({
-      where: { email: sendPasswordResetOtpDto.email },
-    });
+    const user = await this.userRepository.findOne({});
 
     if (!user) {

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:294:11
 
   async resendResetPasswordVerificationOtp(resendOtpDto: ResendOtpDto) {
     try {
-      if (!resendOtpDto.email) {
+      if (false) {
         throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
       }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:294:11
 
   async resendResetPasswordVerificationOtp(resendOtpDto: ResendOtpDto) {
     try {
-      if (!resendOtpDto.email) {
+      if (true) {
         throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
       }

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:298:54
         throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
       }
 
-      const user = await this.userRepository.findOne({
-        where: { email: resendOtpDto.email },
-      });
+      const user = await this.userRepository.findOne({});
       if (!user) {
         throw new NotFoundException(UserMessages.USER_NOT_FOUND);

[NoCoverage] BlockStatement
src/auth/auth.service.ts:301:18
       const user = await this.userRepository.findOne({
         where: { email: resendOtpDto.email },
       });
-      if (!user) {
-        throw new NotFoundException(UserMessages.USER_NOT_FOUND);
-      }
+      if (!user) {}
 
       const otp = this.userHelper.generateVerificationCode();

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:320:9
       return { message: UserMessages.OTP_SENT };
     } catch (error) {
       throw new InternalServerErrorException(
-        error || 'Error resending verification code',
+        true,
       );
     }

[NoCoverage] BlockStatement
src/auth/auth.service.ts:326:30
   }
 
   async verifyResetPasswordOtp(verifyOtpDto: VerifyOtpDto) {
-    if (!verifyOtpDto.email) {
-      throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
-    }
+    if (!verifyOtpDto.email) {}
 
     if (!verifyOtpDto.otp) {

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:326:9
   }
 
   async verifyResetPasswordOtp(verifyOtpDto: VerifyOtpDto) {
-    if (!verifyOtpDto.email) {
+    if (false) {
       throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
     }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:330:9
       throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
     }
 
-    if (!verifyOtpDto.otp) {
+    if (false) {
       throw new BadRequestException(UserMessages.OTP_REQUIRED);
     }

[NoCoverage] BooleanLiteral
src/auth/auth.service.ts:330:9
       throw new BadRequestException(UserMessages.EMAIL_REQUIRED);
     }
 
-    if (!verifyOtpDto.otp) {
+    if (verifyOtpDto.otp) {
       throw new BadRequestException(UserMessages.OTP_REQUIRED);
     }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:342:9
       throw new NotFoundException(UserMessages.USER_NOT_FOUND);
     }
 
-    if (user.passwordResetCode !== verifyOtpDto.otp) {
+    if (true) {
       throw new UnauthorizedException(UserMessages.INVALID_OTP);
     }

[NoCoverage] BlockStatement
src/auth/auth.service.ts:342:54
       throw new NotFoundException(UserMessages.USER_NOT_FOUND);
     }
 
-    if (user.passwordResetCode !== verifyOtpDto.otp) {
-      throw new UnauthorizedException(UserMessages.INVALID_OTP);
-    }
+    if (user.passwordResetCode !== verifyOtpDto.otp) {}
 
     if (

[NoCoverage] LogicalOperator
src/auth/auth.service.ts:347:7
     }
 
     if (
-      !user.passwordResetCodeExpiresAt ||
-      (user.passwordResetCodeExpiresAt instanceof Date &&
-        user.passwordResetCodeExpiresAt < new Date())
+      !user.passwordResetCodeExpiresAt && user.passwordResetCodeExpiresAt instanceof Date && user.passwordResetCodeExpiresAt < new Date()
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:347:7
     }
 
     if (
-      !user.passwordResetCodeExpiresAt ||
-      (user.passwordResetCodeExpiresAt instanceof Date &&
-        user.passwordResetCodeExpiresAt < new Date())
+      false
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:348:8
 
     if (
       !user.passwordResetCodeExpiresAt ||
-      (user.passwordResetCodeExpiresAt instanceof Date &&
-        user.passwordResetCodeExpiresAt < new Date())
+      (false)
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] LogicalOperator
src/auth/auth.service.ts:348:8
 
     if (
       !user.passwordResetCodeExpiresAt ||
-      (user.passwordResetCodeExpiresAt instanceof Date &&
-        user.passwordResetCodeExpiresAt < new Date())
+      (user.passwordResetCodeExpiresAt instanceof Date || user.passwordResetCodeExpiresAt < new Date())
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:349:9
     if (
       !user.passwordResetCodeExpiresAt ||
       (user.passwordResetCodeExpiresAt instanceof Date &&
-        user.passwordResetCodeExpiresAt < new Date())
+        true)
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] EqualityOperator
src/auth/auth.service.ts:349:9
     if (
       !user.passwordResetCodeExpiresAt ||
       (user.passwordResetCodeExpiresAt instanceof Date &&
-        user.passwordResetCodeExpiresAt < new Date())
+        user.passwordResetCodeExpiresAt <= new Date())
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] BlockStatement
src/auth/auth.service.ts:350:7
       !user.passwordResetCodeExpiresAt ||
       (user.passwordResetCodeExpiresAt instanceof Date &&
         user.passwordResetCodeExpiresAt < new Date())
-    ) {
-      throw new UnauthorizedException(UserMessages.OTP_EXPIRED);
-    }
+    ) {}
 
     await this.userRepository.save(user);

[NoCoverage] BlockStatement
src/auth/auth.service.ts:359:28
     return { message: UserMessages.OTP_VERIFIED };
   }
 
-  setup2fa(userId: string) {
-    return this.setupTotpProvider.initiate2faSetup(userId);
-  }
+  setup2fa(userId: string) {}
 
   confirm2fa(userId: string, dto: Setup2faDto) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:363:48
     return this.setupTotpProvider.initiate2faSetup(userId);
   }
 
-  confirm2fa(userId: string, dto: Setup2faDto) {
-    return this.setupTotpProvider.confirm2faSetup(userId, dto);
-  }
+  confirm2fa(userId: string, dto: Setup2faDto) {}
 
   verifyTotpLogin(dto: VerifyTotpDto) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:367:39
     return this.setupTotpProvider.confirm2faSetup(userId, dto);
   }
 
-  verifyTotpLogin(dto: VerifyTotpDto) {
-    return this.verifyTotpProvider.verifyTotpLogin(dto);
-  }
+  verifyTotpLogin(dto: VerifyTotpDto) {}
 
   verifyBackupCode(dto: UseBackupCodeDto) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:371:43
     return this.verifyTotpProvider.verifyTotpLogin(dto);
   }
 
-  verifyBackupCode(dto: UseBackupCodeDto) {
-    return this.verifyTotpProvider.verifyBackupCode(dto);
-  }
+  verifyBackupCode(dto: UseBackupCodeDto) {}
 
   disable2fa(userId: string, dto: Disable2faDto) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:375:50
     return this.verifyTotpProvider.verifyBackupCode(dto);
   }
 
-  disable2fa(userId: string, dto: Disable2faDto) {
-    return this.manageTotpProvider.disable2fa(userId, dto);
-  }
+  disable2fa(userId: string, dto: Disable2faDto) {}
 
   get2faStatus(userId: string) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:379:32
     return this.manageTotpProvider.disable2fa(userId, dto);
   }
 
-  get2faStatus(userId: string) {
-    return this.manageTotpProvider.get2faStatus(userId);
-  }
+  get2faStatus(userId: string) {}
 
   async resetPassword(resetPasswordDto: ResetPasswordDto) {

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:386:54
   async resetPassword(resetPasswordDto: ResetPasswordDto) {
     const { otp, newPassword, confirmNewPassword } = resetPasswordDto;
 
-    const user = await this.userRepository.findOneBy({
-      passwordResetCode: otp,
-    });
+    const user = await this.userRepository.findOneBy({});
 
     if (!user) {

[NoCoverage] BlockStatement
src/auth/auth.service.ts:390:16
       passwordResetCode: otp,
     });
 
-    if (!user) {
-      throw new NotFoundException(UserMessages.USER_NOT_FOUND);
-    }
+    if (!user) {}
 
     if (

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:395:7
     }
 
     if (
-      !user.passwordResetCodeExpiresAt ||
-      user.passwordResetCodeExpiresAt < new Date()
+      true
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] LogicalOperator
src/auth/auth.service.ts:395:7
     }
 
     if (
-      !user.passwordResetCodeExpiresAt ||
-      user.passwordResetCodeExpiresAt < new Date()
+      !user.passwordResetCodeExpiresAt && user.passwordResetCodeExpiresAt < new Date()
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:396:7
 
     if (
       !user.passwordResetCodeExpiresAt ||
-      user.passwordResetCodeExpiresAt < new Date()
+      false
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] EqualityOperator
src/auth/auth.service.ts:396:7
 
     if (
       !user.passwordResetCodeExpiresAt ||
-      user.passwordResetCodeExpiresAt < new Date()
+      user.passwordResetCodeExpiresAt <= new Date()
     ) {
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);

[NoCoverage] BlockStatement
src/auth/auth.service.ts:397:7
     if (
       !user.passwordResetCodeExpiresAt ||
       user.passwordResetCodeExpiresAt < new Date()
-    ) {
-      throw new UnauthorizedException(UserMessages.OTP_EXPIRED);
-    }
+    ) {}
 
     if (!this.userHelper.isValidPassword(newPassword)) {

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:401:9
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);
     }
 
-    if (!this.userHelper.isValidPassword(newPassword)) {
+    if (true) {
       throw new BadRequestException(UserMessages.IS_VALID_PASSWORD);
     }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:401:9
       throw new UnauthorizedException(UserMessages.OTP_EXPIRED);
     }
 
-    if (!this.userHelper.isValidPassword(newPassword)) {
+    if (false) {
       throw new BadRequestException(UserMessages.IS_VALID_PASSWORD);
     }

[NoCoverage] EqualityOperator
src/auth/auth.service.ts:405:9
       throw new BadRequestException(UserMessages.IS_VALID_PASSWORD);
     }
 
-    if (newPassword !== confirmNewPassword) {
+    if (newPassword === confirmNewPassword) {
       throw new BadRequestException(UserMessages.PASSWORDS_DO_NOT_MATCH);
     }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:405:9
       throw new BadRequestException(UserMessages.IS_VALID_PASSWORD);
     }
 
-    if (newPassword !== confirmNewPassword) {
+    if (false) {
       throw new BadRequestException(UserMessages.PASSWORDS_DO_NOT_MATCH);
     }
