[NoCoverage] StringLiteral
src/auth/guard/jwt.auth.guard.ts:7:45
 import { PUBLIC } from '../decorators/public.decorator';
 
 @Injectable()
-export class JwtAuthGuard extends AuthGuard('jwt') {
+export class JwtAuthGuard extends AuthGuard("") {
   constructor(private reflector: Reflector) {
     super();

[NoCoverage] BlockStatement
src/auth/guard/jwt.auth.guard.ts:12:42
     super();
   }
 
-  canActivate(context: ExecutionContext) {
-    const isPublic = this.reflector.getAllAndOverride<boolean>(PUBLIC, [
-      context.getHandler(),
-      context.getClass(),
-    ]);
-
-    if (isPublic) {
-      return true;
-    }
-
-    return super.canActivate(context);
-  }
+  canActivate(context: ExecutionContext) {}
 }
 

[NoCoverage] BooleanLiteral
src/auth/guard/jwt.auth.guard.ts:19:14
     ]);
 
     if (isPublic) {
-      return true;
+      return false;
     }
 
