[Killed] BlockStatement
src/auth/helper/jwt-helper.ts:20:68
 export class JwtHelper {
   constructor(private readonly jwtService: JwtService) {}
 
-  public validateRefreshToken(refreshToken: string): string | null {
-    try {
-      const payload = this.jwtService.verify<JwtPayload>(refreshToken, {
-        secret: process.env.JWT_REFRESH_SECRET as string,
-      });
-
-      return payload?.sub ?? null;
-    } catch (error: unknown) {
-      if (error instanceof Error) {
-        console.error('JWT verification failed:', error.message);
-      } else {
-        console.error('JWT verification failed:', error);
-      }
-      throw new UnauthorizedException(UserMessages.INVALID_REFRESH_TOKEN);
-    }
-  }
+  public validateRefreshToken(refreshToken: string): string | null {}
 
   public generateAccessToken(user: User): string {
killedBy: JwtHelper validateRefreshToken returns sub when token valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-id"
Received: undefined

[Killed] BlockStatement
src/auth/helper/jwt-helper.ts:21:9
   constructor(private readonly jwtService: JwtService) {}
 
   public validateRefreshToken(refreshToken: string): string | null {
-    try {
-      const payload = this.jwtService.verify<JwtPayload>(refreshToken, {
-        secret: process.env.JWT_REFRESH_SECRET as string,
-      });
-
-      return payload?.sub ?? null;
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
       if (error instanceof Error) {
         console.error('JWT verification failed:', error.message);
killedBy: JwtHelper validateRefreshToken returns sub when token valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-id"
Received: undefined

[Killed] LogicalOperator
src/auth/helper/jwt-helper.ts:26:14
         secret: process.env.JWT_REFRESH_SECRET as string,
       });
 
-      return payload?.sub ?? null;
+      return payload?.sub && null;
     } catch (error: unknown) {
       if (error instanceof Error) {
killedBy: JwtHelper validateRefreshToken returns sub when token valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user-id"
Received: null

[Survived] OptionalChaining
src/auth/helper/jwt-helper.ts:26:14
         secret: process.env.JWT_REFRESH_SECRET as string,
       });
 
-      return payload?.sub ?? null;
+      return payload.sub ?? null;
     } catch (error: unknown) {
       if (error instanceof Error) {

[Killed] BlockStatement
src/auth/helper/jwt-helper.ts:27:30
       });
 
       return payload?.sub ?? null;
-    } catch (error: unknown) {
-      if (error instanceof Error) {
-        console.error('JWT verification failed:', error.message);
-      } else {
-        console.error('JWT verification failed:', error);
-      }
-      throw new UnauthorizedException(UserMessages.INVALID_REFRESH_TOKEN);
-    }
+    } catch (error: unknown) {}
   }
 
killedBy: JwtHelper validateRefreshToken throws when invalid
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UnauthorizedException

Received function did not throw

[Survived] BlockStatement
src/auth/helper/jwt-helper.ts:28:35
 
       return payload?.sub ?? null;
     } catch (error: unknown) {
-      if (error instanceof Error) {
-        console.error('JWT verification failed:', error.message);
-      } else {
+      if (error instanceof Error) {} else {
         console.error('JWT verification failed:', error);
       }

[NoCoverage] BlockStatement
src/auth/helper/jwt-helper.ts:30:14
     } catch (error: unknown) {
       if (error instanceof Error) {
         console.error('JWT verification failed:', error.message);
-      } else {
-        console.error('JWT verification failed:', error);
-      }
+      } else {}
       throw new UnauthorizedException(UserMessages.INVALID_REFRESH_TOKEN);
     }

[Survived] BlockStatement
src/auth/helper/jwt-helper.ts:37:50
     }
   }
 
-  public generateAccessToken(user: User): string {
-    const payload: JwtPayload = {
-      sub: user.id,
-      email: user.email,
-      fullName: user.fullName,
-      role: user.role,
-    };
-
-    return this.jwtService.sign(payload, {
-      secret: process.env.JWT_SECRET as string,
-      expiresIn: (process.env.JWT_EXPIRATION ?? '1h') as JwtExpiry,
-    });
-  }
+  public generateAccessToken(user: User): string {}
 
   public generateRefreshToken(user: User): string {

[Survived] BlockStatement
src/auth/helper/jwt-helper.ts:51:51
     });
   }
 
-  public generateRefreshToken(user: User): string {
-    const payload: JwtPayload = {
-      sub: user.id,
-      email: user.email,
-      fullName: user.fullName,
-    };
-
-    return this.jwtService.sign(payload, {
-      secret: process.env.JWT_REFRESH_SECRET as string,
-      expiresIn: (process.env.JWT_REFRESH_EXPIRATION ?? '7d') as JwtExpiry,
-    });
-  }
+  public generateRefreshToken(user: User): string {}
 
   public generateTokens(user: User) {

[Killed] BlockStatement
src/auth/helper/jwt-helper.ts:64:37
     });
   }
 
-  public generateTokens(user: User) {
-    return {
-      accessToken: this.generateAccessToken(user),
-      refreshToken: this.generateRefreshToken(user),
-    };
-  }
+  public generateTokens(user: User) {}
 
   public generateTempToken(userId: string): string {
killedBy: JwtHelper generateTokens returns both tokens
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[NoCoverage] BlockStatement
src/auth/helper/jwt-helper.ts:71:52
     };
   }
 
-  public generateTempToken(userId: string): string {
-    const payload: TwoFaPendingPayload = { sub: userId, type: '2fa_pending' };
-    return this.jwtService.sign(payload, {
-      secret: process.env.JWT_SECRET as string,
-      expiresIn: '5m' as any,
-    });
-  }
+  public generateTempToken(userId: string): string {}
 
   public verifyTempToken(token: string): TwoFaPendingPayload {

[Killed] BlockStatement
src/auth/helper/jwt-helper.ts:79:62
     });
   }
 
-  public verifyTempToken(token: string): TwoFaPendingPayload {
-    try {
-      const payload = this.jwtService.verify<TwoFaPendingPayload>(token, {
-        secret: process.env.JWT_SECRET as string,
-      });
-      if (payload.type !== '2fa_pending') {
-        throw new UnauthorizedException('Invalid token type');
-      }
-      return payload;
-    } catch {
-      throw new UnauthorizedException('Invalid or expired 2FA token');
-    }
-  }
+  public verifyTempToken(token: string): TwoFaPendingPayload {}
 }
 
killedBy: JwtHelper verifyTempToken returns payload for 2fa_pending
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/auth/helper/jwt-helper.ts:80:9
   }
 
   public verifyTempToken(token: string): TwoFaPendingPayload {
-    try {
-      const payload = this.jwtService.verify<TwoFaPendingPayload>(token, {
-        secret: process.env.JWT_SECRET as string,
-      });
-      if (payload.type !== '2fa_pending') {
-        throw new UnauthorizedException('Invalid token type');
-      }
-      return payload;
-    } catch {
+    try {} catch {
       throw new UnauthorizedException('Invalid or expired 2FA token');
     }
killedBy: JwtHelper verifyTempToken returns payload for 2fa_pending
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
src/auth/helper/jwt-helper.ts:84:11
       const payload = this.jwtService.verify<TwoFaPendingPayload>(token, {
         secret: process.env.JWT_SECRET as string,
       });
-      if (payload.type !== '2fa_pending') {
+      if (payload.type === '2fa_pending') {
         throw new UnauthorizedException('Invalid token type');
       }
killedBy: JwtHelper verifyTempToken returns payload for 2fa_pending
statusReason: UnauthorizedException: Invalid or expired 2FA token

[Killed] ConditionalExpression
src/auth/helper/jwt-helper.ts:84:11
       const payload = this.jwtService.verify<TwoFaPendingPayload>(token, {
         secret: process.env.JWT_SECRET as string,
       });
-      if (payload.type !== '2fa_pending') {
+      if (false) {
         throw new UnauthorizedException('Invalid token type');
       }
killedBy: JwtHelper verifyTempToken throws for wrong type
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UnauthorizedException

Received function did not throw

[Survived] StringLiteral
src/auth/helper/jwt-helper.ts:85:41
         secret: process.env.JWT_SECRET as string,
       });
       if (payload.type !== '2fa_pending') {
-        throw new UnauthorizedException('Invalid token type');
+        throw new UnauthorizedException("");
       }
       return payload;

[Killed] BlockStatement
src/auth/helper/jwt-helper.ts:88:13
         throw new UnauthorizedException('Invalid token type');
       }
       return payload;
-    } catch {
-      throw new UnauthorizedException('Invalid or expired 2FA token');
-    }
+    } catch {}
   }
 }
killedBy: JwtHelper verifyTempToken throws for wrong type
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: UnauthorizedException

Received function did not throw
