[Killed] BlockStatement
src/auth/helper/user-helper.ts:9:23
   public async verifyPassword(
     plainPassword: string,
     hashedPassword: string,
-  ): Promise<boolean> {
-    return bcrypt.compare(plainPassword, hashedPassword);
-  }
+  ): Promise<boolean> {}
 
   public async hashPassword(password: string): Promise<string> {
killedBy: UserHelper hashes and verifies a password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/auth/helper/user-helper.ts:13:64
     return bcrypt.compare(plainPassword, hashedPassword);
   }
 
-  public async hashPassword(password: string): Promise<string> {
-    return bcrypt.hash(password, 10);
-  }
+  public async hashPassword(password: string): Promise<string> {}
 
   public formatUserResponse(user: User) {
killedBy: UserHelper hashes and verifies a password
statusReason: Error: data and hash arguments required

[NoCoverage] BlockStatement
src/auth/helper/user-helper.ts:17:41
     return bcrypt.hash(password, 10);
   }
 
-  public formatUserResponse(user: User) {
-    return {
-      id: user.id,
-      firstname: user.firstname,
-      lastname: user.lastname,
-      email: user.email,
-      role: user.role,
-      isActive: user.isActive,
-      isSuspended: user.isSuspended,
-      isDeleted: user.isDeleted,
-      createdAt: user.createdAt,
-      updatedAt: user.updatedAt,
-      deletedAt: user.deletedAt,
-    };
-  }
+  public formatUserResponse(user: User) {}
 
   public isValidPassword(password: string) {

[NoCoverage] ObjectLiteral
src/auth/helper/user-helper.ts:18:12
   }
 
   public formatUserResponse(user: User) {
-    return {
-      id: user.id,
-      firstname: user.firstname,
-      lastname: user.lastname,
-      email: user.email,
-      role: user.role,
-      isActive: user.isActive,
-      isSuspended: user.isSuspended,
-      isDeleted: user.isDeleted,
-      createdAt: user.createdAt,
-      updatedAt: user.updatedAt,
-      deletedAt: user.deletedAt,
-    };
+    return {};
   }
 

[Killed] BlockStatement
src/auth/helper/user-helper.ts:33:44
     };
   }
 
-  public isValidPassword(password: string) {
-    const minLength = 8;
-    const hasUpperCase = /[A-Z]/.test(password);
-    const hasLowerCase = /[a-z]/.test(password);
-    const hasDigits = /\d/.test(password);
-
-    return (
-      password.length >= minLength && hasUpperCase && hasLowerCase && hasDigits
-    );
-  }
+  public isValidPassword(password: string) {}
 
   public generateVerificationCode(digits: number = 4): string {
killedBy: UserHelper validates a strong password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] Regex
src/auth/helper/user-helper.ts:37:23
     const minLength = 8;
     const hasUpperCase = /[A-Z]/.test(password);
     const hasLowerCase = /[a-z]/.test(password);
-    const hasDigits = /\d/.test(password);
+    const hasDigits = /\D/.test(password);
 
     return (
killedBy: UserHelper rejects invalid password NoDigits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/auth/helper/user-helper.ts:40:7
     const hasDigits = /\d/.test(password);
 
     return (
-      password.length >= minLength && hasUpperCase && hasLowerCase && hasDigits
+      password.length >= minLength && hasUpperCase && hasLowerCase || hasDigits
     );
   }
killedBy: UserHelper rejects invalid password lowercase1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/auth/helper/user-helper.ts:40:7
     const hasDigits = /\d/.test(password);
 
     return (
-      password.length >= minLength && hasUpperCase && hasLowerCase && hasDigits
+      password.length >= minLength || hasUpperCase && hasLowerCase && hasDigits
     );
   }
killedBy: UserHelper rejects invalid password lowercase1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/auth/helper/user-helper.ts:44:63
     );
   }
 
-  public generateVerificationCode(digits: number = 4): string {
-    const max = Math.pow(10, digits) - 1;
-    const min = Math.pow(10, digits - 1);
-
-    return (Math.floor(Math.random() * (max - min + 1)) + min).toString();
-  }
+  public generateVerificationCode(digits: number = 4): string {}
 }
 
killedBy: UserHelper generates a 4-digit verification code
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/auth/helper/user-helper.ts:45:17
   }
 
   public generateVerificationCode(digits: number = 4): string {
-    const max = Math.pow(10, digits) - 1;
+    const max = Math.pow(10, digits) + 1;
     const min = Math.pow(10, digits - 1);
 
killedBy: UserHelper generates min and max verification codes when Math.random is mocked
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5
Received string: "10001"

[Killed] ArithmeticOperator
src/auth/helper/user-helper.ts:46:30
 
   public generateVerificationCode(digits: number = 4): string {
     const max = Math.pow(10, digits) - 1;
-    const min = Math.pow(10, digits - 1);
+    const min = Math.pow(10, digits + 1);
 
     return (Math.floor(Math.random() * (max - min + 1)) + min).toString();
killedBy: UserHelper generates a 4-digit verification code
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5
Received string: "71276"

[Killed] ArithmeticOperator
src/auth/helper/user-helper.ts:48:41
     const max = Math.pow(10, digits) - 1;
     const min = Math.pow(10, digits - 1);
 
-    return (Math.floor(Math.random() * (max - min + 1)) + min).toString();
+    return (Math.floor(Math.random() * (max + min + 1)) + min).toString();
   }
 }
killedBy: UserHelper generates min and max verification codes when Math.random is mocked
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5
Received string: "11999"

[Killed] ArithmeticOperator
src/auth/helper/user-helper.ts:48:24
     const max = Math.pow(10, digits) - 1;
     const min = Math.pow(10, digits - 1);
 
-    return (Math.floor(Math.random() * (max - min + 1)) + min).toString();
+    return (Math.floor(Math.random() / (max - min + 1)) + min).toString();
   }
 }
killedBy: UserHelper generates min and max verification codes when Math.random is mocked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9999
Received: 1000
