[NoCoverage] BlockStatement
src/auth/providers/generateTokens.provider.ts:9:58
 export class GenerateTokensProvider {
   constructor(private readonly jwtService: JwtService) {}
 
-  async generateAccessToken(user: User): Promise<string> {
-    return this.jwtService.signAsync(
-      { sub: user.id, role: user.role, email: user.email },
-      { expiresIn: (process.env.JWT_ACCESS_EXPIRATION ?? '15m') as any },
-    );
-  }
+  async generateAccessToken(user: User): Promise<string> {}
 
   async generateRefreshToken(user: User): Promise<string> {

[NoCoverage] BlockStatement
src/auth/providers/generateTokens.provider.ts:16:59
     );
   }
 
-  async generateRefreshToken(user: User): Promise<string> {
-    return this.jwtService.signAsync(
-      { sub: user.id },
-      { expiresIn: (process.env.JWT_REFRESH_EXPIRATION ?? '7d') as any },
-    );
-  }
+  async generateRefreshToken(user: User): Promise<string> {}
 
   async generateBothTokens(

[NoCoverage] ObjectLiteral
src/auth/providers/generateTokens.provider.ts:19:7
   async generateRefreshToken(user: User): Promise<string> {
     return this.jwtService.signAsync(
       { sub: user.id },
-      { expiresIn: (process.env.JWT_REFRESH_EXPIRATION ?? '7d') as any },
+      {},
     );
   }

[NoCoverage] BlockStatement
src/auth/providers/generateTokens.provider.ts:25:61
 
   async generateBothTokens(
     user: User,
-  ): Promise<{ accessToken: string; refreshToken: string }> {
-    const [accessToken, refreshToken] = await Promise.all([
-      this.generateAccessToken(user),
-      this.generateRefreshToken(user),
-    ]);
-
-    return { accessToken, refreshToken };
-  }
+  ): Promise<{ accessToken: string; refreshToken: string }> {}
 }
 

[NoCoverage] ObjectLiteral
src/auth/providers/generateTokens.provider.ts:31:12
       this.generateRefreshToken(user),
     ]);
 
-    return { accessToken, refreshToken };
+    return {};
   }
 }
