[NoCoverage] BlockStatement
src/auth/providers/hashing.provider.ts:6:46
 
 @Injectable()
 export class HashingProvider {
-  async hash(plain: string): Promise<string> {
-    const saltRounds = 10;
-    return bcrypt.hash(plain, saltRounds);
-  }
+  async hash(plain: string): Promise<string> {}
 
   async compare(plain: string, hashed: string): Promise<boolean> {

[NoCoverage] BlockStatement
src/auth/providers/hashing.provider.ts:11:66
     return bcrypt.hash(plain, saltRounds);
   }
 
-  async compare(plain: string, hashed: string): Promise<boolean> {
-    return bcrypt.compare(plain, hashed);
-  }
+  async compare(plain: string, hashed: string): Promise<boolean> {}
 }
 
