[NoCoverage] BlockStatement
src/auth/providers/manage-totp.provider.ts:16:56
     private readonly hashingProvider: HashingProvider,
   ) {}
 
-  async disable2fa(userId: string, dto: Disable2faDto) {
-    const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user) throw new UnauthorizedException('User not found');
-
-    const passwordValid = await this.hashingProvider.compare(
-      dto.password,
-      user.password,
-    );
-    if (!passwordValid) {
-      throw new UnauthorizedException('Invalid password');
-    }
-
-    user.twoFactorEnabled = false;
-    user.totpSecret = null;
-    user.totpBackupCodes = null;
-    await this.usersRepository.save(user);
-
-    return { message: '2FA has been disabled' };
-  }
+  async disable2fa(userId: string, dto: Disable2faDto) {}
 
   async get2faStatus(userId: string) {

[NoCoverage] ConditionalExpression
src/auth/providers/manage-totp.provider.ts:18:9
 
   async disable2fa(userId: string, dto: Disable2faDto) {
     const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user) throw new UnauthorizedException('User not found');
+    if (true) throw new UnauthorizedException('User not found');
 
     const passwordValid = await this.hashingProvider.compare(

[NoCoverage] ConditionalExpression
src/auth/providers/manage-totp.provider.ts:18:9
 
   async disable2fa(userId: string, dto: Disable2faDto) {
     const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user) throw new UnauthorizedException('User not found');
+    if (false) throw new UnauthorizedException('User not found');
 
     const passwordValid = await this.hashingProvider.compare(

[NoCoverage] BlockStatement
src/auth/providers/manage-totp.provider.ts:24:25
       dto.password,
       user.password,
     );
-    if (!passwordValid) {
-      throw new UnauthorizedException('Invalid password');
-    }
+    if (!passwordValid) {}
 
     user.twoFactorEnabled = false;

[NoCoverage] BooleanLiteral
src/auth/providers/manage-totp.provider.ts:24:9
       dto.password,
       user.password,
     );
-    if (!passwordValid) {
+    if (passwordValid) {
       throw new UnauthorizedException('Invalid password');
     }

[NoCoverage] BooleanLiteral
src/auth/providers/manage-totp.provider.ts:28:29
       throw new UnauthorizedException('Invalid password');
     }
 
-    user.twoFactorEnabled = false;
+    user.twoFactorEnabled = true;
     user.totpSecret = null;
     user.totpBackupCodes = null;

[NoCoverage] BlockStatement
src/auth/providers/manage-totp.provider.ts:36:38
     return { message: '2FA has been disabled' };
   }
 
-  async get2faStatus(userId: string) {
-    const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user) throw new UnauthorizedException('User not found');
-
-    return {
-      enabled: user.twoFactorEnabled,
-      backupCodesRemaining: user.totpBackupCodes?.length ?? 0,
-    };
-  }
+  async get2faStatus(userId: string) {}
 }
 

[NoCoverage] ObjectLiteral
src/auth/providers/manage-totp.provider.ts:37:62
   }
 
   async get2faStatus(userId: string) {
-    const user = await this.usersRepository.findOne({ where: { id: userId } });
+    const user = await this.usersRepository.findOne({ where: {} });
     if (!user) throw new UnauthorizedException('User not found');
 

[NoCoverage] ObjectLiteral
src/auth/providers/manage-totp.provider.ts:40:12
     const user = await this.usersRepository.findOne({ where: { id: userId } });
     if (!user) throw new UnauthorizedException('User not found');
 
-    return {
-      enabled: user.twoFactorEnabled,
-      backupCodesRemaining: user.totpBackupCodes?.length ?? 0,
-    };
+    return {};
   }
 }

[NoCoverage] LogicalOperator
src/auth/providers/manage-totp.provider.ts:42:29
 
     return {
       enabled: user.twoFactorEnabled,
-      backupCodesRemaining: user.totpBackupCodes?.length ?? 0,
+      backupCodesRemaining: user.totpBackupCodes?.length && 0,
     };
   }

[NoCoverage] OptionalChaining
src/auth/providers/manage-totp.provider.ts:42:29
 
     return {
       enabled: user.twoFactorEnabled,
-      backupCodesRemaining: user.totpBackupCodes?.length ?? 0,
+      backupCodesRemaining: user.totpBackupCodes.length ?? 0,
     };
   }
