[NoCoverage] BlockStatement
src/auth/providers/refreshToken.repository.ts:14:76
     private readonly repo: Repository<RefreshToken>,
   ) {}
 
-  async saveRefreshToken(user: User, token: string): Promise<RefreshToken> {
-    const expiresAt = this.computeExpiryFromEnv();
-
-    const rt = this.repo.create({
-      userId: user.id,
-      token,
-      expiresAt,
-      revoked: false,
-    });
-
-    return this.repo.save(rt);
-  }
+  async saveRefreshToken(user: User, token: string): Promise<RefreshToken> {}
 
   async revokeToken(token: string): Promise<void> {

[NoCoverage] ObjectLiteral
src/auth/providers/refreshToken.repository.ts:17:33
   async saveRefreshToken(user: User, token: string): Promise<RefreshToken> {
     const expiresAt = this.computeExpiryFromEnv();
 
-    const rt = this.repo.create({
-      userId: user.id,
-      token,
-      expiresAt,
-      revoked: false,
-    });
+    const rt = this.repo.create({});
 
     return this.repo.save(rt);

[NoCoverage] BooleanLiteral
src/auth/providers/refreshToken.repository.ts:21:16
       userId: user.id,
       token,
       expiresAt,
-      revoked: false,
+      revoked: true,
     });
 

[NoCoverage] BlockStatement
src/auth/providers/refreshToken.repository.ts:27:51
     return this.repo.save(rt);
   }
 
-  async revokeToken(token: string): Promise<void> {
-    await this.repo.update({ token }, { revoked: true });
-  }
+  async revokeToken(token: string): Promise<void> {}
 
   async findValidToken(token: string): Promise<RefreshToken | null> {

[NoCoverage] BooleanLiteral
src/auth/providers/refreshToken.repository.ts:28:50
   }
 
   async revokeToken(token: string): Promise<void> {
-    await this.repo.update({ token }, { revoked: true });
+    await this.repo.update({ token }, { revoked: false });
   }
 

[NoCoverage] BlockStatement
src/auth/providers/refreshToken.repository.ts:31:69
     await this.repo.update({ token }, { revoked: true });
   }
 
-  async findValidToken(token: string): Promise<RefreshToken | null> {
-    const rt = await this.repo.findOne({ where: { token } });
-    if (!rt) return null;
-    if (rt.revoked) return null;
-    if (rt.expiresAt && rt.expiresAt < new Date()) return null;
-    return rt;
-  }
+  async findValidToken(token: string): Promise<RefreshToken | null> {}
 
   private computeExpiryFromEnv(): Date | undefined {

[NoCoverage] ObjectLiteral
src/auth/providers/refreshToken.repository.ts:32:49
   }
 
   async findValidToken(token: string): Promise<RefreshToken | null> {
-    const rt = await this.repo.findOne({ where: { token } });
+    const rt = await this.repo.findOne({ where: {} });
     if (!rt) return null;
     if (rt.revoked) return null;

[NoCoverage] BooleanLiteral
src/auth/providers/refreshToken.repository.ts:33:9
 
   async findValidToken(token: string): Promise<RefreshToken | null> {
     const rt = await this.repo.findOne({ where: { token } });
-    if (!rt) return null;
+    if (rt) return null;
     if (rt.revoked) return null;
     if (rt.expiresAt && rt.expiresAt < new Date()) return null;

[NoCoverage] ConditionalExpression
src/auth/providers/refreshToken.repository.ts:33:9
 
   async findValidToken(token: string): Promise<RefreshToken | null> {
     const rt = await this.repo.findOne({ where: { token } });
-    if (!rt) return null;
+    if (true) return null;
     if (rt.revoked) return null;
     if (rt.expiresAt && rt.expiresAt < new Date()) return null;

[NoCoverage] ConditionalExpression
src/auth/providers/refreshToken.repository.ts:34:9
   async findValidToken(token: string): Promise<RefreshToken | null> {
     const rt = await this.repo.findOne({ where: { token } });
     if (!rt) return null;
-    if (rt.revoked) return null;
+    if (false) return null;
     if (rt.expiresAt && rt.expiresAt < new Date()) return null;
     return rt;

[NoCoverage] ConditionalExpression
src/auth/providers/refreshToken.repository.ts:34:9
   async findValidToken(token: string): Promise<RefreshToken | null> {
     const rt = await this.repo.findOne({ where: { token } });
     if (!rt) return null;
-    if (rt.revoked) return null;
+    if (true) return null;
     if (rt.expiresAt && rt.expiresAt < new Date()) return null;
     return rt;

[NoCoverage] ConditionalExpression
src/auth/providers/refreshToken.repository.ts:35:9
     const rt = await this.repo.findOne({ where: { token } });
     if (!rt) return null;
     if (rt.revoked) return null;
-    if (rt.expiresAt && rt.expiresAt < new Date()) return null;
+    if (true) return null;
     return rt;
   }

[NoCoverage] ConditionalExpression
src/auth/providers/refreshToken.repository.ts:35:25
     const rt = await this.repo.findOne({ where: { token } });
     if (!rt) return null;
     if (rt.revoked) return null;
-    if (rt.expiresAt && rt.expiresAt < new Date()) return null;
+    if (rt.expiresAt && true) return null;
     return rt;
   }

[NoCoverage] BlockStatement
src/auth/providers/refreshToken.repository.ts:39:52
     return rt;
   }
 
-  private computeExpiryFromEnv(): Date | undefined {
-    // supports ms number or '7d' etc? We'll keep ms for now.
-    const raw = process.env.JWT_REFRESH_EXPIRATION;
-    if (!raw) return undefined;
-
-    const ms = Number(raw);
-    if (Number.isFinite(ms) && ms > 0) {
-      return new Date(Date.now() + ms);
-    }
-    return undefined;
-  }
+  private computeExpiryFromEnv(): Date | undefined {}
 
   async revokeAllRefreshTokens(userId: string): Promise<void> {

[NoCoverage] ConditionalExpression
src/auth/providers/refreshToken.repository.ts:42:9
   private computeExpiryFromEnv(): Date | undefined {
     // supports ms number or '7d' etc? We'll keep ms for now.
     const raw = process.env.JWT_REFRESH_EXPIRATION;
-    if (!raw) return undefined;
+    if (false) return undefined;
 
     const ms = Number(raw);

[NoCoverage] ConditionalExpression
src/auth/providers/refreshToken.repository.ts:42:9
   private computeExpiryFromEnv(): Date | undefined {
     // supports ms number or '7d' etc? We'll keep ms for now.
     const raw = process.env.JWT_REFRESH_EXPIRATION;
-    if (!raw) return undefined;
+    if (true) return undefined;
 
     const ms = Number(raw);

[NoCoverage] BlockStatement
src/auth/providers/refreshToken.repository.ts:45:40
     if (!raw) return undefined;
 
     const ms = Number(raw);
-    if (Number.isFinite(ms) && ms > 0) {
-      return new Date(Date.now() + ms);
-    }
+    if (Number.isFinite(ms) && ms > 0) {}
     return undefined;
   }

[NoCoverage] ConditionalExpression
src/auth/providers/refreshToken.repository.ts:45:9
     if (!raw) return undefined;
 
     const ms = Number(raw);
-    if (Number.isFinite(ms) && ms > 0) {
+    if (true) {
       return new Date(Date.now() + ms);
     }

[NoCoverage] ArithmeticOperator
src/auth/providers/refreshToken.repository.ts:46:23
 
     const ms = Number(raw);
     if (Number.isFinite(ms) && ms > 0) {
-      return new Date(Date.now() + ms);
+      return new Date(Date.now() - ms);
     }
     return undefined;

[NoCoverage] BlockStatement
src/auth/providers/refreshToken.repository.ts:51:63
     return undefined;
   }
 
-  async revokeAllRefreshTokens(userId: string): Promise<void> {
-    await this.repo.update({ userId }, { revoked: true });
-  }
+  async revokeAllRefreshTokens(userId: string): Promise<void> {}
 }
 

[NoCoverage] BooleanLiteral
src/auth/providers/refreshToken.repository.ts:52:51
   }
 
   async revokeAllRefreshTokens(userId: string): Promise<void> {
-    await this.repo.update({ userId }, { revoked: true });
+    await this.repo.update({ userId }, { revoked: false });
   }
 }

[NoCoverage] ObjectLiteral
src/auth/providers/refreshToken.repository.ts:52:28
   }
 
   async revokeAllRefreshTokens(userId: string): Promise<void> {
-    await this.repo.update({ userId }, { revoked: true });
+    await this.repo.update({}, { revoked: true });
   }
 }
