[NoCoverage] BlockStatement
src/auth/providers/setup-totp.provider.ts:19:42
     private readonly usersRepository: Repository<User>,
   ) {}
 
-  async initiate2faSetup(userId: string) {
-    const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user) throw new UnauthorizedException('User not found');
-
-    const secret = generateSecret();
-    user.totpSecret = secret;
-    await this.usersRepository.save(user);
-
-    const otpauth = generateURI({
-      issuer: 'NovaLabs',
-      label: user.email,
-      secret,
-    });
-    const qrCodeDataUrl = await QRCode.toDataURL(otpauth);
-
-    return { secret, qrCodeDataUrl };
-  }
+  async initiate2faSetup(userId: string) {}
 
   async confirm2faSetup(userId: string, dto: Setup2faDto) {

[NoCoverage] ObjectLiteral
src/auth/providers/setup-totp.provider.ts:20:53
   ) {}
 
   async initiate2faSetup(userId: string) {
-    const user = await this.usersRepository.findOne({ where: { id: userId } });
+    const user = await this.usersRepository.findOne({});
     if (!user) throw new UnauthorizedException('User not found');
 

[NoCoverage] BooleanLiteral
src/auth/providers/setup-totp.provider.ts:21:9
 
   async initiate2faSetup(userId: string) {
     const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user) throw new UnauthorizedException('User not found');
+    if (user) throw new UnauthorizedException('User not found');
 
     const secret = generateSecret();

[NoCoverage] ObjectLiteral
src/auth/providers/setup-totp.provider.ts:34:12
     });
     const qrCodeDataUrl = await QRCode.toDataURL(otpauth);
 
-    return { secret, qrCodeDataUrl };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/auth/providers/setup-totp.provider.ts:37:59
     return { secret, qrCodeDataUrl };
   }
 
-  async confirm2faSetup(userId: string, dto: Setup2faDto) {
-    const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user || !user.totpSecret) {
-      throw new UnauthorizedException('2FA setup not initiated');
-    }
-
-    const result = verifySync({ token: dto.token, secret: user.totpSecret });
-    if (!result?.valid) {
-      throw new UnauthorizedException('Invalid TOTP code');
-    }
-
-    // Generate 8 plain backup codes, store hashed
-    const plainCodes = Array.from({ length: 8 }, () =>
-      crypto.randomBytes(5).toString('hex'),
-    );
-    const hashedCodes = await Promise.all(
-      plainCodes.map((c) => bcrypt.hash(c, 10)),
-    );
-
-    user.twoFactorEnabled = true;
-    user.totpBackupCodes = hashedCodes;
-    await this.usersRepository.save(user);
-
-    return { backupCodes: plainCodes };
-  }
+  async confirm2faSetup(userId: string, dto: Setup2faDto) {}
 }
 

[NoCoverage] ObjectLiteral
src/auth/providers/setup-totp.provider.ts:38:62
   }
 
   async confirm2faSetup(userId: string, dto: Setup2faDto) {
-    const user = await this.usersRepository.findOne({ where: { id: userId } });
+    const user = await this.usersRepository.findOne({ where: {} });
     if (!user || !user.totpSecret) {
       throw new UnauthorizedException('2FA setup not initiated');

[NoCoverage] ConditionalExpression
src/auth/providers/setup-totp.provider.ts:39:9
 
   async confirm2faSetup(userId: string, dto: Setup2faDto) {
     const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user || !user.totpSecret) {
+    if (true) {
       throw new UnauthorizedException('2FA setup not initiated');
     }

[NoCoverage] LogicalOperator
src/auth/providers/setup-totp.provider.ts:39:9
 
   async confirm2faSetup(userId: string, dto: Setup2faDto) {
     const user = await this.usersRepository.findOne({ where: { id: userId } });
-    if (!user || !user.totpSecret) {
+    if (!user && !user.totpSecret) {
       throw new UnauthorizedException('2FA setup not initiated');
     }

[NoCoverage] StringLiteral
src/auth/providers/setup-totp.provider.ts:40:39
   async confirm2faSetup(userId: string, dto: Setup2faDto) {
     const user = await this.usersRepository.findOne({ where: { id: userId } });
     if (!user || !user.totpSecret) {
-      throw new UnauthorizedException('2FA setup not initiated');
+      throw new UnauthorizedException("");
     }
 

[NoCoverage] ObjectLiteral
src/auth/providers/setup-totp.provider.ts:43:31
       throw new UnauthorizedException('2FA setup not initiated');
     }
 
-    const result = verifySync({ token: dto.token, secret: user.totpSecret });
+    const result = verifySync({});
     if (!result?.valid) {
       throw new UnauthorizedException('Invalid TOTP code');

[NoCoverage] ConditionalExpression
src/auth/providers/setup-totp.provider.ts:44:9
     }
 
     const result = verifySync({ token: dto.token, secret: user.totpSecret });
-    if (!result?.valid) {
+    if (true) {
       throw new UnauthorizedException('Invalid TOTP code');
     }

[NoCoverage] OptionalChaining
src/auth/providers/setup-totp.provider.ts:44:10
     }
 
     const result = verifySync({ token: dto.token, secret: user.totpSecret });
-    if (!result?.valid) {
+    if (!result.valid) {
       throw new UnauthorizedException('Invalid TOTP code');
     }

[NoCoverage] StringLiteral
src/auth/providers/setup-totp.provider.ts:45:39
 
     const result = verifySync({ token: dto.token, secret: user.totpSecret });
     if (!result?.valid) {
-      throw new UnauthorizedException('Invalid TOTP code');
+      throw new UnauthorizedException("");
     }
 

[NoCoverage] ArrowFunction
src/auth/providers/setup-totp.provider.ts:49:50
     }
 
     // Generate 8 plain backup codes, store hashed
-    const plainCodes = Array.from({ length: 8 }, () =>
-      crypto.randomBytes(5).toString('hex'),
+    const plainCodes = Array.from({ length: 8 }, () => undefined,
     );
     const hashedCodes = await Promise.all(

[NoCoverage] ArrowFunction
src/auth/providers/setup-totp.provider.ts:53:22
       crypto.randomBytes(5).toString('hex'),
     );
     const hashedCodes = await Promise.all(
-      plainCodes.map((c) => bcrypt.hash(c, 10)),
+      plainCodes.map(() => undefined),
     );
 

[NoCoverage] BooleanLiteral
src/auth/providers/setup-totp.provider.ts:56:29
       plainCodes.map((c) => bcrypt.hash(c, 10)),
     );
 
-    user.twoFactorEnabled = true;
+    user.twoFactorEnabled = false;
     user.totpBackupCodes = hashedCodes;
     await this.usersRepository.save(user);
