[NoCoverage] BlockStatement
src/auth/providers/verify-totp.provider.ts:19:45
     private readonly jwtHelper: JwtHelper,
   ) {}
 
-  async verifyTotpLogin(dto: VerifyTotpDto) {
-    const payload = this.jwtHelper.verifyTempToken(dto.tempToken);
-    const user = await this.usersRepository.findOne({
-      where: { id: payload.sub },
-    });
-    if (!user || !user.totpSecret) {
-      throw new UnauthorizedException('User not found or 2FA not set up');
-    }
-
-    const result = verifySync({ token: dto.token, secret: user.totpSecret });
-    if (!result?.valid) {
-      throw new UnauthorizedException('Invalid TOTP code');
-    }
-
-    const tokens = this.jwtHelper.generateTokens(user);
-    return {
-      user: { id: user.id, email: user.email, role: user.role },
-      ...tokens,
-    };
-  }
+  async verifyTotpLogin(dto: VerifyTotpDto) {}
 
   async verifyBackupCode(dto: UseBackupCodeDto) {

[NoCoverage] LogicalOperator
src/auth/providers/verify-totp.provider.ts:24:9
     const user = await this.usersRepository.findOne({
       where: { id: payload.sub },
     });
-    if (!user || !user.totpSecret) {
+    if (!user && !user.totpSecret) {
       throw new UnauthorizedException('User not found or 2FA not set up');
     }

[NoCoverage] BlockStatement
src/auth/providers/verify-totp.provider.ts:24:36
     const user = await this.usersRepository.findOne({
       where: { id: payload.sub },
     });
-    if (!user || !user.totpSecret) {
-      throw new UnauthorizedException('User not found or 2FA not set up');
-    }
+    if (!user || !user.totpSecret) {}
 
     const result = verifySync({ token: dto.token, secret: user.totpSecret });

[NoCoverage] StringLiteral
src/auth/providers/verify-totp.provider.ts:25:39
       where: { id: payload.sub },
     });
     if (!user || !user.totpSecret) {
-      throw new UnauthorizedException('User not found or 2FA not set up');
+      throw new UnauthorizedException("");
     }
 

[NoCoverage] BlockStatement
src/auth/providers/verify-totp.provider.ts:29:25
     }
 
     const result = verifySync({ token: dto.token, secret: user.totpSecret });
-    if (!result?.valid) {
-      throw new UnauthorizedException('Invalid TOTP code');
-    }
+    if (!result?.valid) {}
 
     const tokens = this.jwtHelper.generateTokens(user);

[NoCoverage] ObjectLiteral
src/auth/providers/verify-totp.provider.ts:35:13
 
     const tokens = this.jwtHelper.generateTokens(user);
     return {
-      user: { id: user.id, email: user.email, role: user.role },
+      user: {},
       ...tokens,
     };

[NoCoverage] ObjectLiteral
src/auth/providers/verify-totp.provider.ts:42:53
 
   async verifyBackupCode(dto: UseBackupCodeDto) {
     const payload = this.jwtHelper.verifyTempToken(dto.tempToken);
-    const user = await this.usersRepository.findOne({
-      where: { id: payload.sub },
-    });
+    const user = await this.usersRepository.findOne({});
     if (!user || !user.totpBackupCodes?.length) {
       throw new UnauthorizedException(

[NoCoverage] OptionalChaining
src/auth/providers/verify-totp.provider.ts:45:19
     const user = await this.usersRepository.findOne({
       where: { id: payload.sub },
     });
-    if (!user || !user.totpBackupCodes?.length) {
+    if (!user || !user.totpBackupCodes.length) {
       throw new UnauthorizedException(
         'User not found or no backup codes available',

[NoCoverage] ConditionalExpression
src/auth/providers/verify-totp.provider.ts:45:9
     const user = await this.usersRepository.findOne({
       where: { id: payload.sub },
     });
-    if (!user || !user.totpBackupCodes?.length) {
+    if (false) {
       throw new UnauthorizedException(
         'User not found or no backup codes available',

[NoCoverage] UnaryOperator
src/auth/providers/verify-totp.provider.ts:51:24
       );
     }
 
-    let matchedIndex = -1;
+    let matchedIndex = +1;
     for (let i = 0; i < user.totpBackupCodes.length; i++) {
       const match = await bcrypt.compare(

[NoCoverage] EqualityOperator
src/auth/providers/verify-totp.provider.ts:52:21
     }
 
     let matchedIndex = -1;
-    for (let i = 0; i < user.totpBackupCodes.length; i++) {
+    for (let i = 0; i <= user.totpBackupCodes.length; i++) {
       const match = await bcrypt.compare(
         dto.backupCode,

[NoCoverage] BlockStatement
src/auth/providers/verify-totp.provider.ts:52:59
     }
 
     let matchedIndex = -1;
-    for (let i = 0; i < user.totpBackupCodes.length; i++) {
-      const match = await bcrypt.compare(
-        dto.backupCode,
-        user.totpBackupCodes[i],
-      );
-      if (match) {
-        matchedIndex = i;
-        break;
-      }
-    }
+    for (let i = 0; i < user.totpBackupCodes.length; i++) {}
 
     if (matchedIndex === -1) {

[NoCoverage] BlockStatement
src/auth/providers/verify-totp.provider.ts:57:18
         dto.backupCode,
         user.totpBackupCodes[i],
       );
-      if (match) {
-        matchedIndex = i;
-        break;
-      }
+      if (match) {}
     }
 

[NoCoverage] ConditionalExpression
src/auth/providers/verify-totp.provider.ts:57:11
         dto.backupCode,
         user.totpBackupCodes[i],
       );
-      if (match) {
+      if (false) {
         matchedIndex = i;
         break;

[NoCoverage] ConditionalExpression
src/auth/providers/verify-totp.provider.ts:63:9
       }
     }
 
-    if (matchedIndex === -1) {
+    if (true) {
       throw new UnauthorizedException('Invalid backup code');
     }

[NoCoverage] ConditionalExpression
src/auth/providers/verify-totp.provider.ts:63:9
       }
     }
 
-    if (matchedIndex === -1) {
+    if (false) {
       throw new UnauthorizedException('Invalid backup code');
     }

[NoCoverage] MethodExpression
src/auth/providers/verify-totp.provider.ts:68:28
     }
 
     // Remove the used code
-    user.totpBackupCodes = user.totpBackupCodes.filter(
-      (_, i) => i !== matchedIndex,
-    );
+    user.totpBackupCodes = user.totpBackupCodes;
     await this.usersRepository.save(user);
 

[NoCoverage] ConditionalExpression
src/auth/providers/verify-totp.provider.ts:69:17
 
     // Remove the used code
     user.totpBackupCodes = user.totpBackupCodes.filter(
-      (_, i) => i !== matchedIndex,
+      (_, i) => false,
     );
     await this.usersRepository.save(user);

[NoCoverage] ArrowFunction
src/auth/providers/verify-totp.provider.ts:69:7
 
     // Remove the used code
     user.totpBackupCodes = user.totpBackupCodes.filter(
-      (_, i) => i !== matchedIndex,
+      () => undefined,
     );
     await this.usersRepository.save(user);

[NoCoverage] ObjectLiteral
src/auth/providers/verify-totp.provider.ts:74:12
     await this.usersRepository.save(user);
 
     const tokens = this.jwtHelper.generateTokens(user);
-    return {
-      user: { id: user.id, email: user.email, role: user.role },
-      ...tokens,
-      backupCodesRemaining: user.totpBackupCodes.length,
-    };
+    return {};
   }
 }
