[NoCoverage] BooleanLiteral
src/auth/strategy/jwt.strategy.ts:12:9
 export class JwtStrategy extends PassportStrategy(Strategy) {
   constructor(private readonly authService: AuthService) {
     const secret = process.env.JWT_SECRET;
-    if (!secret) {
+    if (secret) {
       throw new Error(UserMessages.ACCESS_TOKEN_SECRET_NOT_SET);
     }

[NoCoverage] ConditionalExpression
src/auth/strategy/jwt.strategy.ts:12:9
 export class JwtStrategy extends PassportStrategy(Strategy) {
   constructor(private readonly authService: AuthService) {
     const secret = process.env.JWT_SECRET;
-    if (!secret) {
+    if (false) {
       throw new Error(UserMessages.ACCESS_TOKEN_SECRET_NOT_SET);
     }

[NoCoverage] BooleanLiteral
src/auth/strategy/jwt.strategy.ts:17:25
     }
     super({
       jwtFromRequest: ExtractJwt.fromAuthHeaderAsBearerToken(),
-      ignoreExpiration: false,
+      ignoreExpiration: true,
       secretOrKey: secret,
     });

[NoCoverage] BlockStatement
src/auth/strategy/jwt.strategy.ts:22:39
     });
   }
 
-  async validate(payload: JwtPayload) {
-    try {
-      const user = await this.authService.retrieveUserById(payload.sub);
-      return {
-        id: user.id,
-        fullName: `${user.firstname} ${user.lastname}`,
-        email: user.email,
-        role: payload.role,
-      };
-    } catch (error) {
-      throw new UnauthorizedException(UserMessages.INVALID_ACCESS_TOKEN);
-    }
-  }
+  async validate(payload: JwtPayload) {}
 }
 

[NoCoverage] BlockStatement
src/auth/strategy/jwt.strategy.ts:23:9
   }
 
   async validate(payload: JwtPayload) {
-    try {
-      const user = await this.authService.retrieveUserById(payload.sub);
-      return {
-        id: user.id,
-        fullName: `${user.firstname} ${user.lastname}`,
-        email: user.email,
-        role: payload.role,
-      };
-    } catch (error) {
+    try {} catch (error) {
       throw new UnauthorizedException(UserMessages.INVALID_ACCESS_TOKEN);
     }

[NoCoverage] ObjectLiteral
src/auth/strategy/jwt.strategy.ts:25:14
   async validate(payload: JwtPayload) {
     try {
       const user = await this.authService.retrieveUserById(payload.sub);
-      return {
-        id: user.id,
-        fullName: `${user.firstname} ${user.lastname}`,
-        email: user.email,
-        role: payload.role,
-      };
+      return {};
     } catch (error) {
       throw new UnauthorizedException(UserMessages.INVALID_ACCESS_TOKEN);

[NoCoverage] BlockStatement
src/auth/strategy/jwt.strategy.ts:31:21
         email: user.email,
         role: payload.role,
       };
-    } catch (error) {
-      throw new UnauthorizedException(UserMessages.INVALID_ACCESS_TOKEN);
-    }
+    } catch (error) {}
   }
 }
