[Survived] ArrayDeclaration
src/auth/guard/roles.guard.ts:25:7
   canActivate(context: ExecutionContext): boolean {
     const requiredRoles = this.reflector.getAllAndOverride<UserRole[]>(
       ROLES_KEY,
-      [context.getHandler(), context.getClass()],
+      [],
     );
 

[Killed] BlockStatement
src/auth/guard/roles.guard.ts:28:25
       [context.getHandler(), context.getClass()],
     );
 
-    if (!requiredRoles) {
-      return true;
-    }
+    if (!requiredRoles) {}
 
     const request = context
killedBy: RolesGuard returns true when no roles required
statusReason: ForbiddenException: user not authenticated

[Killed] ConditionalExpression
src/auth/guard/roles.guard.ts:28:9
       [context.getHandler(), context.getClass()],
     );
 
-    if (!requiredRoles) {
+    if (false) {
       return true;
     }
killedBy: RolesGuard returns true when no roles required
statusReason: ForbiddenException: user not authenticated

[Killed] BooleanLiteral
src/auth/guard/roles.guard.ts:29:14
     );
 
     if (!requiredRoles) {
-      return true;
+      return false;
     }
 
killedBy: RolesGuard returns true when no roles required
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/auth/guard/roles.guard.ts:37:16
       .getRequest<{ user?: { role?: UserRole } }>();
     const { user } = request;
 
-    if (!user) {
-      throw new ForbiddenException('user not authenticated');
-    }
+    if (!user) {}
 
     const userLevel = ROLE_HIERARCHY[user.role as UserRole] ?? 0;
killedBy: RolesGuard throws when user not present
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ForbiddenException
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'role')"

      89 |         }

[Killed] LogicalOperator
src/auth/guard/roles.guard.ts:41:23
       throw new ForbiddenException('user not authenticated');
     }
 
-    const userLevel = ROLE_HIERARCHY[user.role as UserRole] ?? 0;
+    const userLevel = ROLE_HIERARCHY[user.role as UserRole] && 0;
     const hasRequiredRole = requiredRoles.some(
       (role) => userLevel >= ROLE_HIERARCHY[role],
killedBy: RolesGuard returns true when user has sufficient role
statusReason: ForbiddenException: You do not have permission to perform this action

[Survived] MethodExpression
src/auth/guard/roles.guard.ts:42:29
     }
 
     const userLevel = ROLE_HIERARCHY[user.role as UserRole] ?? 0;
-    const hasRequiredRole = requiredRoles.some(
-      (role) => userLevel >= ROLE_HIERARCHY[role],
-    );
+    const hasRequiredRole = requiredRoles.every(role => userLevel >= ROLE_HIERARCHY[role]);
 
     if (!hasRequiredRole) {

[Killed] ArrowFunction
src/auth/guard/roles.guard.ts:43:7
 
     const userLevel = ROLE_HIERARCHY[user.role as UserRole] ?? 0;
     const hasRequiredRole = requiredRoles.some(
-      (role) => userLevel >= ROLE_HIERARCHY[role],
+      () => undefined,
     );
 
killedBy: RolesGuard returns true when user has sufficient role
statusReason: ForbiddenException: You do not have permission to perform this action

[Killed] EqualityOperator
src/auth/guard/roles.guard.ts:43:17
 
     const userLevel = ROLE_HIERARCHY[user.role as UserRole] ?? 0;
     const hasRequiredRole = requiredRoles.some(
-      (role) => userLevel >= ROLE_HIERARCHY[role],
+      (role) => userLevel < ROLE_HIERARCHY[role],
     );
 
killedBy: RolesGuard throws when user level insufficient
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ForbiddenException

Received function did not throw

[Killed] ConditionalExpression
src/auth/guard/roles.guard.ts:46:9
       (role) => userLevel >= ROLE_HIERARCHY[role],
     );
 
-    if (!hasRequiredRole) {
+    if (false) {
       throw new ForbiddenException(
         'You do not have permission to perform this action',
killedBy: RolesGuard throws when user level insufficient
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ForbiddenException

Received function did not throw

[Killed] BooleanLiteral
src/auth/guard/roles.guard.ts:46:9
       (role) => userLevel >= ROLE_HIERARCHY[role],
     );
 
-    if (!hasRequiredRole) {
+    if (hasRequiredRole) {
       throw new ForbiddenException(
         'You do not have permission to perform this action',
killedBy: RolesGuard throws when user level insufficient
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ForbiddenException

Received function did not throw
